chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx775f256h.h
PLIB_INLINE_API USB_INTERRUPTS PLIB_USB_InterruptFlagAllGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_InterruptFlagAllGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_INTERRUPTS)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsGEN_InterruptStatus(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsGEN_InterruptStatus_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_InterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_InterruptEnable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_InterruptDisable(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_InterruptDisable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_InterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_InterruptIsEnabled_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsGEN_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsGEN_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_AllInterruptEnable(USB_MODULE_ID index, USB_INTERRUPTS usbInterruptsFlag, USB_ERROR_INTERRUPTS usbErrorInterruptsFlag, USB_OTG_INTERRUPTS otgInterruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_AllInterruptEnable_Default(index, usbInterruptsFlag, usbErrorInterruptsFlag, otgInterruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API USB_INTERRUPTS PLIB_USB_InterruptEnableGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_InterruptEnableGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_INTERRUPTS)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsALL_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsALL_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_ErrorInterruptFlagSet(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptFlagSet_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_ErrorInterruptFlagClear(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptFlagClear_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ErrorInterruptFlagGet(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ErrorInterruptFlagGet_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API USB_ERROR_INTERRUPTS PLIB_USB_ErrorInterruptFlagAllGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ErrorInterruptFlagAllGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_ERROR_INTERRUPTS)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsERR_InterruptStatus(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsERR_InterruptStatus_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_ErrorInterruptEnable(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptEnable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_ErrorInterruptDisable(USB_MODULE_ID index, USB_ERROR_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_ErrorInterruptDisable_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ErrorInterruptIsEnabled(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ErrorInterruptIsEnabled_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsERR_Interrupt(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsERR_Interrupt_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_USB_LastTransactionEndPtGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_LastTransactionEndPtGet_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

